cask_args appdir: '/Applications'

# tap
tap 'homebrew/versions'
tap 'neovim/neovim'
tap 'sanemat/font'
tap 'universal-ctags/universal-ctags'
tap 'homebrew/fuse'
tap 'homebrew/science'

# package
brew 'libtermkey'
brew 'libuv'
brew 'libvterm'
brew 'msgpack'
brew 'shared-mime-info'
brew 'unibilium'
brew 'cask'
brew 'mas'
brew 'zsh', args: [ 'disable-etcdir' ]
brew 'gdb'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'openssl'
brew 'ghq'
brew 'wget'
brew 'tmux'
brew 'htop'
brew 'reattach-to-user-namespace'
brew 'neovim'
brew 'verilator'
brew 'ag'
brew 'ricty', args: ['vim-powerline', 'powerline']
brew 'llvm', args: ['with-clang', '--with-libcxx', '--without-assertions', '--with-rtti' ]
brew 'nkf'
brew 'qemu'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
brew 'cscope'
brew 'doxygen'
brew 'graphviz'
brew 'bear'
brew 'rtags'
brew 'minicom'
brew 'binutils'
brew 'dtc'
brew 'sshfs'
brew 'socat'
brew 'icarus-verilog'
brew 'bazel'
brew 'swig'
brew 'aspell', args: ['--lang=en']
brew 'tbb'
brew 'ffmpeg'
brew 'opencv3', args: ['--with-ffmpeg', '--with-tbb', '--with-python3']
brew 'golang'
brew 'libjpeg-turbo'

# cask
cask 'docker'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'Caskroom/versions/java7'
cask 'google-japanese-ime'
cask 'google-chrome'
cask 'google-drive'
cask 'google-photos-backup'
cask 'xquartz'
cask 'iterm2'
cask 'karabiner'
cask 'alfred'
cask 'franz'
cask 'dropbox'
cask 'kindle'
cask 'dash'
cask 'bettertouchtool'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vagrant'
cask 'ipartition'
cask 'xtrafinder'
cask 'the-unarchiver'
cask 'insomniax'
cask 'appcleaner'
cask 'parallels-desktop'
cask 'hyperswitch'
cask 'imageoptim'
cask 'avira-antivirus'
cask 'skim'
cask 'vlc'
cask 'anytrans'
cask 'night-owl'
cask 'amazon-music'
cask 'amazon-drive'
cask 'forklift'
cask 'bathyscaphe'
cask 'contexts'
cask 'slack'
cask 'key-codes'
cask 'keyboardcleantool'
cask 'hammerspoon'
cask 'eclipse-ide'
cask 'eclipse-cpp'

# appstore
# mas '1Password', id: 443987910
# mas 'Xcode', id: 497799835
mas 'Quiver', id: 866773894
mas 'Fantastical2', id: 975937182
mas 'LINE', id: 539883307
mas 'Memory Cleaner X', id: 518830108
mas 'PopClip', id: 445189367
mas 'まるごと英和検索 for 英辞郎', id: 919856506
mas 'Translate Tab', id:458887729
mas 'Wunderlist', id: 410628904

