cask_args appdir: '/Applications'

# tap
tap 'neovim/neovim'

# package
brew 'cask'
brew 'mas'
brew 'openssl'
brew 'ghq'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'neovim'

# cask
cask 'google-japanese-ime'
cask 'google-chrome'
cask 'google-photos-backup'
cask 'iterm2'
cask 'karabiner'
cask 'alfred'
cask 'franz'
cask 'dropbox'
cask 'kindle'
cask 'dash'
cask 'bettertouchtool'
cask 'popclip'
cask 'virtualbox'
cask 'vagrant'
cask 'ipartition'
cask 'xtrafinder'
cask 'the-unarchiver'
cask 'insomniax'
cask 'fantastical'
cask 'appcleaner'

# appstore
# mas '1Password', id: 443987910 
# mas 'Xcode', id: 497799835
mas 'Quiver', id: 866773894 
