cask_args appdir: '/Applications'

# tap
tap 'neovim/neovim'

# package
brew 'cask'
brew 'mas'
brew 'zsh', args: [ 'disable-etcdir' ]
brew 'gcc'
brew 'pyenv'
brew 'rbenv'
brew 'openssl'
brew 'ghq'
brew 'wget'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'neovim'
brew 'verilator'
brew 'ctags'
brew 'ag'

# cask
cask 'google-japanese-ime'
cask 'google-chrome'
cask 'google-photos-backup'
cask 'iterm2'
cask 'karabiner'
cask 'alfred'
cask 'franz'
cask 'dropbox'
cask 'kindle'
cask 'dash'
cask 'bettertouchtool'
cask 'popclip'
cask 'virtualbox'
cask 'vagrant'
cask 'ipartition'
cask 'xtrafinder'
cask 'the-unarchiver'
cask 'insomniax'
cask 'appcleaner'
cask 'parallels-desktop'
cask 'hyperswitch'
cask 'skim'
cask 'vlc'
cask 'anytrans'
cask 'night-owl'
# cask 'amazon-music'

# appstore
# mas '1Password', id: 443987910
# mas 'Xcode', id: 497799835
mas 'Quiver', id: 866773894
mas 'Dash3', id: 449589707
mas 'Fantastical2', id: 975937182

