cask_args appdir: "/Applications"

cask "google-japanese-ime"
cask "google-chrome"
cask "visual-studio-code"
cask "dropbox"
cask "alfred"
cask "karabiner-elements"
cask "bettertouchtool"
cask "parallels"
cask "docker"
cask "dash"
cask "contexts"
cask "forklift"
cask "appcleaner"
cask "parallels"
cask "iTerm2"
cask "java"
cask "slack"
cask "franz"
cask "kindle"
cask "skim"
cask "gyazo"
cask "xquartz"
cask "inkscape"
cask "sourcetrail"
cask "sourcetree"
cask "insomniax"
cask "yed"
cask "krita"

mas "1Password", id: 443987910
mas "PopClip", id: 445189367
mas "LINE", id: 539883307
mas "Quiver", id: 866773894
mas "Fantastical 2", id: 975937182
mas "Mate: Universal Tab Translator", id: 1005088137

brew "git"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "zsh"
brew "tmux"
brew "reattach-to-user-namespace"
brew "ghq"
brew "wget"
brew "neovim"
brew "gcc"
brew "binutils"
brew "llvm"
brew "nasm"
brew "ripgrep"
brew "the_silver_searcher"
brew "cmake"
brew "cmake"
brew "ninja"
brew "boost"
brew "flex"
brew "bison"
brew "haskell-stack"
brew "ghc"
brew "sbt"
brew "minicom"
brew "bear"

# for pyenv 
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz" 
brew "zlib"
